app/Controllers/AdminDashboard.php

    protected function getStats(): array
    {
        $db = \Config\Database::connect();

        return [
            'employees_active' => (int) $db->table('employes')->where('actif', 1)->countAllResults(),
            'pending_requests' => (int) $db->table('conger')->where('id_status', 1)->countAllResults(),
            'approved_requests' => (int) $db->table('conger')->where('id_status', 2)->countAllResults(),
            'departments_count' => (int) $db->table('departements')->countAllResults(),
            'types_count' => (int) $db->table('TypeConger')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `conger`
WHERE `id_status` = 1
SELECT COUNT(*) AS `numrows`
FROM `conger`
WHERE `id_status` = 2
SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `actif` = 1
SELECT COUNT(*) AS `numrows`
FROM `departements`
SELECT COUNT(*) AS `numrows`
FROM `TypeConger`

    public function dashboard()
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();
        $stats = $this->getStats();
        $departments = $db->table('departements')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `departements`

    public function employes()
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();
        $stats = $this->getStats();
        $employes = $db->table('employes')
            ->select('employes.*, departements.nom as departement_nom')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->orderBy('employes.id', 'DESC')
            ->get()
            ->getResultArray();

        $rhAccounts = $db->table('rh')
            ->orderBy('id', 'DESC')
            ->get()
            ->getResultArray();

        $departements = $db->table('departements')
            ->orderBy('nom', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `employes`.*, `departements`.`nom` as `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
ORDER BY `employes`.`id` DESC
SELECT *
FROM `departements`
ORDER BY `nom` ASC

    public function departements()
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();
        $stats = $this->getStats();
        $departements = $db->table('departements')
            ->orderBy('nom', 'ASC')
            ->get()
            ->getResultArray();

        $data = [
            'user_nom' => trim((string) ($this->session->get('user_prenom') ?? '') . ' ' . (string) ($this->session->get('user_nom') ?? 'Administrateur')),
            'user_role' => 'Admin système',
            'page' => 'departements',
            'pending_count' => $stats['pending_requests'],
            'departements' => $departements,
        ];
---
SELECT *
FROM `departements`
ORDER BY `nom` ASC

    public function typesConge()
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();
        $stats = $this->getStats();
        $typesConge = $db->table('TypeConger')
            ->orderBy('nom', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `TypeConger`
ORDER BY `nom` ASC

    public function demandesAll()
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();
        $stats = $this->getStats();

        $conges = $db->table('conger')
            ->select('conger.id, conger.employe_id, conger.type_conger_id, conger.date_debut, conger.date_fin, conger.id_status, employes.nom as nom_emp, employes.prenom as prenom_emp, TypeConger.nom as type_nom, Status.nom as status_nom')
            ->join('employes', 'employes.id = conger.employe_id', 'left')
            ->join('TypeConger', 'TypeConger.id = conger.type_conger_id', 'left')
            ->join('Status', 'Status.id = conger.id_status', 'left')
            ->orderBy('conger.id', 'DESC')
            ->get()
            ->getResultArray();

        $data = [
            'user_nom' => trim((string) ($this->session->get('user_prenom') ?? '') . ' ' . (string) ($this->session->get('user_nom') ?? 'Administrateur')),
            'user_role' => 'Admin système',
            'page' => 'demandes',
            'pending_count' => $stats['pending_requests'],
            'conges' => $conges,
        ];
---
SELECT `conger`.`id`, `conger`.`employe_id`, `conger`.`type_conger_id`, `conger`.`date_debut`, `conger`.`date_fin`, `conger`.`id_status`, `employes`.`nom` as `nom_emp`, `employes`.`prenom` as `prenom_emp`, `TypeConger`.`nom` as `type_nom`, `Status`.`nom` as `status_nom`
FROM `conger`
LEFT JOIN `employes` ON `employes`.`id` = `conger`.`employe_id`
LEFT JOIN `TypeConger` ON `TypeConger`.`id` = `conger`.`type_conger_id`
LEFT JOIN `Status` ON `Status`.`id` = `conger`.`id_status`
ORDER BY `conger`.`id` DESC
SELECT *
FROM `TypeConger`
ORDER BY `nom` ASC

    public function toggleEmploye($id)
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();
        $employe = $db->table('employes')->where('id', $id)->limit(1)->get()->getRowArray();
        if (!$employe) {
            return redirect()->back()->with('error', 'Employé introuvable');
        }

        $db->table('employes')->where('id', $id)->update(['actif' => $employe['actif'] ? 0 : 1]);
---
SELECT *
FROM `employes`
WHERE `id` = '2'
 LIMIT 1
UPDATE `employes` SET `actif` = 0
WHERE `id` = '2'

    public function removeEmploye($id)
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();

        // Vérifier les demandes liées
        $used = $db->table('conger')->where('employe_id', $id)->limit(1)->get()->getRowArray();
        if ($used) {
            return redirect()->back()->with('error', 'Impossible de supprimer: des demandes de congé existent pour cet employé');
        }

        // Supprimer les soldes puis l'employé
        $db->table('Soldes_emp')->where('employe_id', $id)->delete();
        $db->table('employes')->where('id', $id)->delete();
---
SELECT *
FROM `conger`
WHERE `employe_id` = '4'
 LIMIT 1
DELETE FROM `Soldes_emp`
WHERE `employe_id` = '4'
DELETE FROM `employes`
WHERE `id` = '4'