app/Controllers/EmployeDashboard.php

SELECT `conger`.*, `tc`.`nom` as `type_nom`, `s`.`nom` as `status_nom`
FROM `conger`
LEFT JOIN `TypeConger` as `tc` ON `conger`.`type_conger_id` = `tc`.`id`
LEFT JOIN `Status` as `s` ON `conger`.`id_status` = `s`.`id`
WHERE `conger`.`employe_id` = 2
ORDER BY `conger`.`date_debut` DESC
SELECT `Soldes_emp`.*, `tc`.`nom` as `type_nom`
FROM `Soldes_emp`
LEFT JOIN `TypeConger` as `tc` ON `Soldes_emp`.`type_conger_id` = `tc`.`id`
WHERE `Soldes_emp`.`employe_id` = 2
---
    public function dashboard()
    {
        if ($redirect = $this->checkAuth()) {
            return $redirect;
        }

        $db = \Config\Database::connect();
        $employe_id = $this->session->get('employe_id') ?? $this->session->get('user_id');

        // Récupérer les demandes de congé de l'employé
        $conges = $db->table('conger')
            ->select('conger.*, tc.nom as type_nom, s.nom as status_nom')
            ->join('TypeConger as tc', 'conger.type_conger_id = tc.id', 'left')
            ->join('Status as s', 'conger.id_status = s.id', 'left')
            ->where('conger.employe_id', $employe_id)
            ->orderBy('conger.date_debut', 'DESC')
            ->get()
            ->getResultArray();

        // Récupérer les soldes de congés
        $soldes = $db->table('Soldes_emp')
            ->select('Soldes_emp.*, tc.nom as type_nom')
            ->join('TypeConger as tc', 'Soldes_emp.type_conger_id = tc.id', 'left')
            ->where('Soldes_emp.employe_id', $employe_id)
            ->get()
            ->getResultArray();