app/Models/EmployeModel.php

    public function authentifier($email, $password)
    {
        $employe = $this->where('email', $email)
            ->where('actif', 1)
            ->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'Steeven@gmail.com'
AND `actif` = 1
 LIMIT 1

    public function getCongés($employe_id)
    {
        $db = \Config\Database::connect();
        return $db->table('conger')
            ->select('conger.*, TypeConger.nom as type_nom,Status.id as id_status,Status.nom as status_nom')
            ->join('TypeConger', 'TypeConger.id = conger.type_conger_id')
            ->join('Status', 'Status.id = conger.id_status')
            ->where('conger.employe_id', $employe_id)
            ->orderBy('conger.date_debut', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `conger`.*, `TypeConger`.`nom` as `type_nom`, `Status`.`id` as `id_status`, `Status`.`nom` as `status_nom`
FROM `conger`
JOIN `TypeConger` ON `TypeConger`.`id` = `conger`.`type_conger_id`
JOIN `Status` ON `Status`.`id` = `conger`.`id_status`
WHERE `conger`.`employe_id` = 2
ORDER BY `conger`.`date_debut` DESC